<?php

1.2 ОСНОВНЫЕ ОПЕРАТОРЫ


КЛАССИФИКАЦИЯ ОПЕРАТОРОВ
• Арифметические
• Сравнения
• Логические
• Строковый
• Инкремент/декремент
• Оператор присвоения


АРИФМЕТИЧЕСКИЕ ОПЕРАТОРЫ
• Отрицание (-12)
• Сложение (34 + 46)
• Вычитание (12 - 56)
• Умножение (3 * 5)
• Деление (36 / 2)
• Деление по модулю (36 % 10)
• Возведение в степень (2 ** 8)


ОПЕРАТОРЫ СРАВНЕНИЯ
• Равно (12 == '12')
• Не равно (36 != 12 или 36 <> 12)
• Равно с учетом типа (12 === '12')
• Не равно с учетом типа (12 !== '12')
• Больше (32 > 5)
• Меньше (6 < 22)
• Больше либо равно (36 >= 10)
• Меньше либо равно (2 <= 8)


ЛОГИЧЕСКИЕ ОПЕРАТОРЫ
• И (true && true или true and true)
• ИЛИ (true || false или true or false)
• НЕ (!false)
• Исключающее ИЛИ (true xor false)


СТРОКОВЫЙ ОПЕРАТОР
• Конкатенация ('Hello' . ' ' . 'World')
• В php для склеивания строк нельзя использовать оператор сложения (+)
• Потому что в этом случае строки будут преобразованы в число и потом выполнится обычное сложение


ИНКРЕМЕНТ/ДЕКРЕМЕНТ
• Префиксный инкремент (++12)
• Префиксный декремент (--12)
• Постфиксный инкремент (12++)
• Постфиксный декремент (12--)


ОПЕРАТОР ПРИСВОЕНИЯ
• Присвоение ($a = 12)
• Означает что левый операнд получает значение правого
• Выглядит как равно
• Но оператор равно записывается как ==
• Подробнее рассмотрим его при изучении переменных


ПРИОРИТЕТ ОПЕРАТОРОВ
• Скобки ((, ), [, ])
• Отрицание, инкремент, декремент (! -- ++)
• Умножение и деление (* / %)
• Сложение и вычитание (+ -)
• Больше или меньше (> >= < <=)
• Равенство и не равенство (= !=)
• Побитовые операторы (& |)
• И ИЛИ (&& ||)
• Тернарный оператор (?:)
• присвоение (= += -= *= и т.д.)
• запятая (,)*/

?>
